
        /////////////// სინქრონიზაციაა, მისი განმარტებები და კოდის სახით ახსნა:


// სინქრონიზირებული კოდია რომელიც ერთმანეთის მიმდევრობით ასრულებს, ანუ როდესაც ერთი მოქმედება დასრულდება
// შემდგომ დაიწყება მეორე - ცხოვრებისეული მაგალითი - 'როდესაც აშენებ სახლს, ჯერ ასხავ საძირკველს სიმყარისთვის
// და როცა დაასრულებ საძირკველის ჩასხმას მერე იწყებ უშუალოდ სახლის შენებას,

function cookChicken() {
    console.log('Cooking chicken...');
}

function makeSalad() {
    console.log('Making salad...');
}

function prepareMeal() {
    cookChicken();
    makeSalad();
}

prepareMeal();


       /////////////////// ასინქრონიზაცია, მისი განმარტება:


// ცხოვრებისეული მაგალითი - 'როდესაც ხარ რესტორანში და მზარეულები ერთდროულად რამდენიმე კერძს აკეთებენ, რადგან
// ვერ ასწრებენ ანუ დროში ვერ ეტევიან'