# გამოიწერეთ GOA-ს და low budget stories-ის არხები, უყურეთ და დაალაიქეთ ვიდეოები


# გაიცანით GOAელები დისქორდზე, ემეგობრეთ, ერთად დაჯექით სერვერზე და დაუახლოვდით. 

# print("გავიცანი და დავუმეგობრდი:  " ) ჩამოწერეთ ყველა ვისაც დაუმეგობრდით 


# print("რას ვფიქრობ GOAზე" ) 
# დაპრინტეთ თქვენი აზრი გოაზე,


# ატვირთეთ ყველაფერი გითჰაბზე, day 2 folder-ში, იგივე რეპოზიტორიაში. 




print("გავიცანი და დავუმეგობრდი: გიორგი გაგნიძეს, დათი ჩხიკვაძეს, დემეტრე ექსეულიძეს. ")
print("GOA არის საუკეთესო აკადემია, სადაც ისწავლება ყველაფერი მაღალ დონეზე და რაც მთავარია ხარისხიანად. GOA-ს ყავს საუკეთესო მენტორები, რაზმის ლიდერები და რაც მთავარია არის მეგობრული გარემო, რომელიც ძალიან უწყობს ხელს ხალისიანად ათვისებაში. გოა მართლაც რომ საუკეთესო აკადემიაა პროგრამირების შესასწავლად და მართლაც ღირს აქ სწავლა." )