// package - შეკვრა 

// React ის დაიმპორტების მიმდევრობები 

// import React from 'react';
//import ReactDOM from 'react-dom/client;

// კომპონენტები არის პატარა ნაწილები რომლის შეერთების საშუალებით საბოლოო
// ჯამში იქმნება react ის პროექტი(ასე რომ ვთქვათ ლეგოებივითაა კომპნენტები)

// react ით შექმნილი კომპონენტის სახელი უნდა იწყებოდეს დიდი ასოთი

// მაგ: 
// function Mycomponent() {
//     return <h1>Hello world!</h1>
// }

// logic - ლოგიკა არის ფუნქციის კომპონენტის ტვინი

// vanila JS ნიშნავს რომ არანაირ ბიბლიოთეკას არვიყენებთ

